/*
Нужно написать программу, печатающую значение EOF
*/
#include <stdio.h>
int main()
{
    printf("Значение EOF: %d\n", EOF);
    putchar(EOF);
    putchar('\n');
    return 0;
}